/*************************************************************************
	> File Name:p1028.c
	> Author: shenyuchi
	> Mail: 1349334667@qq.com
	> Created Time:2018年09月09日 星期日 15时41分28秒
 ************************************************************************/

#include<stdio.h>
int main(){
    int n, cnt=1, i, f[1010];
    f[0]=f[1]=1;
    scanf("%d",&n);
    for(i=2;i<=n;i++){
        if(i%2==0){
            f[i]=f[i-1]+f[i/2];
        }else{
            f[i]=f[i-1];
        }
    }
    printf("%d\n",f[n]);
}
