/*************************************************************************
    > File Name: ol25.c
    > Author: ma6174
    > Mail: ma6174@163.com 
    > Created Time: 2018年07月27日 星期五 09时59分01秒
 ************************************************************************/

#include<stdio.h>

int fib[3][1005] = { {0,0}, {1, 1}, {1, 1}};
int n = 2;
int main() {
	while (fib[n % 3][0] < 1000) {
		n += 1;
		int *a = fib[n % 3], *b = fib[(n - 1) % 3], *c = fib[(n - 2) % 3];
		a[0] = b[0];
		for (int i = 1; i <= b[0]; i++) {
			a[i] = b[i] + c[i];
		}
		for (int i = 1; i <= a[0]; i++) {
			if(a[i] < 10) continue;
			a[i + 1] += a[i] / 10;
			a[i] %= 10;
			a[0] += (a[0] == i);
		}
	}
	printf("%d\n", n);
	return 0;
}
